/********************************************************************************/
/*   Copyright (c) 2021 Realtek Semiconductor Corp. All rights reserved.        */
/*                                                                              */
/*   SPDX-License-Identifier: LicenseRef-Realtek-Proprietary                    */
/*                                                                              */
/*   This software component is confidential and proprietary to Realtek         */
/*   Semiconductor Corp. Disclosure, reproduction, redistribution, in whole     */
/*   or in part, of this work and its derivatives without express permission    */
/*   is prohibited.                                                             */
/********************************************************************************/

//----------------------------------------------------------------------------------------------------
// ID Code      : ScalerTypeCTcpmInclude.h No.0000
// Update Note  :
//----------------------------------------------------------------------------------------------------

#if(_TYPE_C_PORT_CTRL_SUPPORT == _ON)
#if(_PORT_CTRL_TCPM_SUPPORT == _ON)
//****************************************************************************
// DEFINITIONS / MACROS
//****************************************************************************
//--------------------------------------------------
// POWER & Data ROLE SWAP OPTIONS (If DRP Must Support One Kind Of Swap)

//--------------------------------------------------
// Enumeration Of TCPCi Power Status & Mask Field (Reg : 0x14H / 0x1EH)
//--------------------------------------------------
typedef enum
{
    _TCPM_TCPCI_PWR_STAT_SNK_VBUS = _BIT0,
    _TCPM_TCPCI_PWR_STAT_VCONN_PRESENT = _BIT1,
    _TCPM_TCPCI_PWR_STAT_VBUS_PRESENT = _BIT2,
    _TCPM_TCPCI_PWR_STAT_VBUS_DETECT = _BIT3,
    _TCPM_TCPCI_PWR_STAT_SRC_VBUS = _BIT4,
    _TCPM_TCPCI_PWR_STAT_SRC_HV = _BIT5,
    _TCPM_TCPCI_PWR_STAT_INIT_STATUS = _BIT6,
    _TCPM_TCPCI_PWR_STAT_DEBUG_ACC = _BIT7,
}EnumTypeCTcpmTcpciPwrStatType;

//--------------------------------------------------
// Enumeration Of TCPCi Fault Status & Mask Field (Reg : 0x15H / 0x1FH)
//--------------------------------------------------
typedef enum
{
    _TCPM_TCPCI_FT_STAT_I2C_ERR = _BIT0,
    _TCPM_TCPCI_FT_STAT_VCONN_OCP = _BIT1,
    _TCPM_TCPCI_FT_STAT_VBUS_OVP = _BIT2,
    _TCPM_TCPCI_FT_STAT_VBUS_OCP = _BIT3,
    _TCPM_TCPCI_FT_STAT_FORCE_VBUS_DISCHARGE = _BIT4,
    _TCPM_TCPCI_FT_STAT_AUTO_DISCHARGE_FAILED = _BIT5,
    _TCPM_TCPCI_FT_STAT_FORCE_OFF_VBUS = _BIT6,
    _TCPM_TCPCI_FT_STAT_DEBUG_ALL_REG_RESET_TO_DEFAULT = _BIT7,
}EnumTypeCTcpmTcpciFtStatType;

//--------------------------------------------------
// Enumeration Of TCPCi Command Type (Reg 0x23H)
//--------------------------------------------------
typedef enum
{
    _TCPM_TCPCI_CMD_WAKE_I2C = 0x11,
    _TCPM_TCPCI_CMD_DIS_VBUS_DET = 0x22,
    _TCPM_TCPCI_CMD_EN_VBUS_DET = 0x33,
    _TCPM_TCPCI_CMD_DIS_SNK_VBUS = 0x44,
    _TCPM_TCPCI_CMD_EN_SNK_VBUS = 0x55,
    _TCPM_TCPCI_CMD_DIS_SRC_VBUS = 0x66,
    _TCPM_TCPCI_CMD_EN_SRC_5V = 0x77,
    _TCPM_TCPCI_CMD_EN_SRC_HV = 0x88,
    _TCPM_TCPCI_CMD_LOOK_4_CONNECTION = 0x99,
    _TCPM_TCPCI_CMD_RX_1_MORE = 0xBB,
    _TCPM_TCPCI_CMD_SEND_FRS_SIGNAL = 0xCC,
    _TCPM_TCPCI_CMD_RESET_TX_BUFFER = 0xDD,
    _TCPM_TCPCI_CMD_RESET_RX_BUFFER = 0xEE,
    _TCPM_TCPCI_CMD_I2C_IDLE = 0xFF,
}EnumTypeCTcpmTcpciCmdType;

//--------------------------------------------------
// Enumeration Of TCPCi Receive Detect Type (Reg 0x2FH)
//--------------------------------------------------
typedef enum
{
    _TCPM_TCPCI_RCV_DET_SOP = _BIT0,
    _TCPM_TCPCI_RCV_DET_SOP_P = _BIT1,
    _TCPM_TCPCI_RCV_DET_SOP_PP = _BIT2,
    _TCPM_TCPCI_RCV_DET_SOP_DBG_P = _BIT3,
    _TCPM_TCPCI_RCV_DET_SOP_DBG_PP = _BIT4,
    _TCPM_TCPCI_RCV_DET_HRST = _BIT5,
    _TCPM_TCPCI_RCV_DET_CRST = _BIT6,
    _TCPM_TCPCI_RCV_DET_AUTO_DISABLE = _BIT7,
}EnumTypeCTcpmTcpciRcvDetType;

//--------------------------------------------------
// Enumeration Of TCPCi Rx Frame Type (Reg 0x30H)
//--------------------------------------------------
typedef enum
{
    _TCPM_TCPCI_RX_FRAME_TYPE_SOP = 0x00,
    _TCPM_TCPCI_RX_FRAME_TYPE_SOP_P = 0X01,
    _TCPM_TCPCI_RX_FRAME_TYPE_SOP_PP = 0x02,
    _TCPM_TCPCI_RX_FRAME_TYPE_SOP_DBG_P = 0x03,
    _TCPM_TCPCI_RX_FRAME_TYPE_SOP_DBG_PP = 0x04,
    _TCPM_TCPCI_RX_FRAME_TYPE_CRST = 0x06,
}EnumTypeCTcpmTcpciRxFrameType;

// TCPM Hw Index Struct
typedef struct
{
    EnumTypeCTcpmIICHwShift enumTcpmIICHwShift;
    EnumTypeCTcpmTcpcHwShift enumTcpmTcpcHwShift;
}StructTypeCTcpmHwShift;

// TCPM Information Struct
typedef struct
{
    EnumTypeCTcpmState enumTcpmState;
    // -----------------------------
    BYTE b2TcpmUsbType : 2;
    BYTE b2TcpmUsbSpeed : 2;
    BYTE b2TcpmUsbRole : 2;
    BYTE b1TcpmConnectorType : 1;
}StructTypeCTcpmInfo;

// TCPM Record Device (TCPC) Information Struct
typedef struct
{
    BYTE ucTcpcType;
    // -----------------------------
    BYTE ucSlaveAddr;
    // -----------------------------
    WORD usAlertValid;
    // -----------------------------
    WORD usVendorID;            // 0x00~01  Vendor ID
    // -----------------------------
    WORD usProductID;           // 0x02~03  Product ID
    // -----------------------------
    WORD usDeviceID;            // 0x04~05  Device ID
    // -----------------------------
    WORD usTypeCVer;            // 0x06~07  TypeC Spec Version
    // -----------------------------
    WORD usPdVer;               // 0x08~09  PD Sepc Version
    // -----------------------------
    WORD usInterfaceVer;        // 0x0A~0B  Interface (TCPCI) Spec Verion
    // -----------------------------
    WORD usAlertMask;           // 0x12~13  Alert Mask
    // -----------------------------
    BYTE ucPowerStatusMask;     // 0x14     Power Status Mask
    // -----------------------------
    BYTE ucFaultStatusMask;     // 0x15     Fault Status Mask
    // -----------------------------
    BYTE ucTcpcControl;         // 0x19     TCPC Control
    // -----------------------------
    BYTE ucRoleControl;         // 0x1A     Role Control
    // -----------------------------
    BYTE ucFaultControl;        // 0x1B     Fault Control
    // -----------------------------
    BYTE ucPowerControl;        // 0x1C     Power Control
    // -----------------------------
    BYTE ucCcStatus;            // 0x1D     CC Status
    // -----------------------------
    BYTE ucFaultStatus;         // 0x1F     Fault Status
    // -----------------------------
    WORD usDeviceCap1;          // 0x24~25  Device Capability 1
    // -----------------------------
    WORD usDeviceCap2;          // 0x26~27  Device Capability 2
    // -----------------------------
    BYTE ucStdInputCap;         // 0x28     Standard Input Capability
    // -----------------------------
    BYTE ucStdOutputCap;        // 0x29     Standard Output Capability
    // -----------------------------
    WORD usDeviceCap3;          // 0x7C~7D  Device Capability
}StructTypeCTcpmDeviceInfo;

// TCPM Cross CC/PD Top Information Struct
typedef struct
{
    BYTE b1PowerRole : 1;
    BYTE b1DataRole : 1;
    BYTE b1VconnRole : 1;
    BYTE b1SrcVbus : 1;
    BYTE b1SnkVbus : 1;
    BYTE b1SrcVconn : 1;
    // -----------------------------
    EnumTypeCOrientation enumOrientation;
}StructTypeCTcpmTopInfo;

// TCPM CC Related Information Struct
typedef struct
{
    EnumTypeCTcpmCcFWState enumTcpmCcFwState;
    // -----------------------------
    EnumTypeCTcpmCcFSM enumTcpmCcFSM;
    // -----------------------------
    BYTE ucDischargeCount;
    // -----------------------------
    BYTE b1ConnectEn : 1;
    BYTE b2PortRole : 2;
    BYTE b2DrpPrefer : 2;
    BYTE b2RpDefValue : 2;
    BYTE b1CCAttached : 1;
    // -----------------------------
    BYTE b1SourceDet : 1;
    BYTE b1SinkDet5V : 1;
    BYTE b1SinkUnattachDbc : 1;
    BYTE b1SinkDet : 1;
    BYTE b1SourceDet0V : 1;
